app/controllers/assets_controller.rb

SELECT * FROM "assets"
SELECT * FROM "locations"
SELECT * FROM "models"
SELECT * FROM "users"
SELECT "roles".id FROM "roles" INNER JOIN "machines_roles" ON "roles".id = "machines_roles".role_id WHERE ("machines_roles".machine_id = NULL )
---
  def index
    @assets = Asset.filter(load_filters).all(:include => {:inventoriable => {:asset => [:user,:location,{:model=>[:manufacturer, :kind]}]}}).sort.map(&:inventoriable)

    # @assets = Asset.filter(load_filters).all( :include => [:location,:interfaces, :user, {:model => [:manufacturer, :kind]}],
    #                                           :order => 'users.login ASC, manufacturers.name ASC')

    #TODO workaround during transition, remove when migration has finished
    if request.format.puppet?
      @physical_assets = PhysicalMachine.all(:include => [:interfaces,:roles,{:asset => [:user,:location,{:model=>[:manufacturer, :kind]}]}])

SELECT * FROM "assets"
---
  def tags
    @assets = Asset.all(:include=> :tags)

SELECT * FROM "assets" WHERE ("assets"."id" = 0)
SELECT * FROM "kinds" WHERE ("kinds"."id" IN (1810332552,1302318729))
SELECT * FROM "locations" WHERE ("locations"."id" IN (1711339714,1711339716,1711339717,1711339718,1711339719,1711339720,1711339721))
SELECT * FROM "manufacturers" WHERE ("manufacturers"."id" IN (1640518054,1640518055,1640518056,1640518045,1640518057,1640518047,1640518049,1640518050,1640518051,1640518052,1640518053))
---
  def load_asset
    @asset       = @asset_class.find(params[:id],:include=>{:asset => [:user,:location,{:model=>[:manufacturer, :kind]}] }) if params[:id]