app/controllers/user_sessions_controller.rb

INSERT INTO "users" ("created_at", "last_request_at", "updated_at", "failed_login_count", "current_login_ip", "site_admin", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('2011-03-22 18:51:33.461503', '2011-03-22 18:51:33.460659', '2011-03-22 18:51:33.461503', 0, E'127.0.0.1', 'f', '2011-03-22 18:51:33.460488', E'0f6810d239171cbf0fb6c79cc80fe7a287bd9b5d643cd69836e2a817c31073ace7f10dab66a1290cd134cda2c6a341c2128efa26b990ffa29ad8e8bb655cd1d9', 1, NULL, E'jtest', NULL, E'jtest@threatmetrix.com') RETURNING "id"
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save