app/controllers/users_controller.rb

  def index
    @users = User.filter(load_filters).all(:order => 'users.login ASC')
---
SELECT * FROM "users" ORDER BY users.login ASC

  def show
    if params[:id]
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = E'2100762310') LIMIT 1